tiborsimon/embedded-tdd-headers/pic/8bit/pic16lf1787_tdd.h
#define TRMT                          522
#define BRGH                          523
#define SENDB                         524
#define SYNC                          525
#define TXEN                          526
#define TX9                           527
#define CSRC                          528
#define BAUD1CON                      529
#define ABDEN                         530
#define WUE                           531
#define BRG16                         532
#define SCKP                          533
#define RCIDL                         534
#define ABDOVF                        535
#define WPUA0                         536
#define WPUA                          537
#define WPUA1                         538
#define WPUA2                         539
#define WPUA3                         540
#define WPUA4                         541
#define WPUA5                         542
#define WPUA6                         543
#define WPUA7                         544
#define WPUB0                         545
#define WPUB                          546
#define WPUB1                         547
#define WPUB2                         548
#define WPUB3                         549
#define WPUB4                         550
#define WPUB5                         551
#define WPUB6                         552
#define WPUB7                         553
#define WPUC0                         554
#define WPUC                          555
#define WPUC1                         556
#define WPUC2                         557
#define WPUC3                         558
#define WPUC4                         559
#define WPUC5                         560
#define WPUC6                         561
#define WPUC7                         562
#define WPUD                          563
#define WPUD0                         564
#define WPUD1                         565
#define WPUD2                         566
#define WPUD3                         567
#define WPUD4                         568
#define WPUD5                         569
#define WPUD6                         570
#define WPUD7                         571
#define WPUE                          572
#define WPUE0                         573
#define WPUE1                         574
#define WPUE2                         575
#define WPUE3                         576
#define SSP1BUF                       577
#define BUF                           578
#define BUF0                          579
#define SSP1BUF0                      580
#define BUF1                          581
#define SSP1BUF1                      582
#define BUF2                          583
#define SSP1BUF2                      584
#define BUF3                          585
#define SSP1BUF3                      586
#define BUF4                          587
#define SSP1BUF4                      588
#define BUF5                          589
#define SSP1BUF5                      590
#define BUF6                          591
#define SSP1BUF6                      592
#define BUF7                          593
#define SSP1BUF7                      594
#define ADD0                          595
#define ADD                           596
#define SSP1ADD0                      597
#define SSP1ADD                       598
#define ADD1                          599
#define SSP1ADD1                      600
#define ADD2                          601
#define SSP1ADD2                      602
#define ADD3                          603
#define SSP1ADD3                      604
#define ADD4                          605
#define SSP1ADD4                      606
#define ADD5                          607
#define SSP1ADD5                      608
#define ADD6                          609
#define SSP1ADD6                      610
#define ADD7                          611
#define SSP1ADD7                      612
#define SSP1MSK0                      613
#define SSP1MSK                       614
#define MSK0                          615
#define MSK                           616
#define SSP1MSK1                      617
#define MSK1                          618
#define SSP1MSK2                      619
#define MSK2                          620
#define SSP1MSK3                      621
#define MSK3                          622
#define SSP1MSK4                      623
#define MSK4                          624
#define SSP1MSK5                      625
#define MSK5                          626
#define SSP1MSK6                      627
#define MSK6                          628
#define SSP1MSK7                      629
#define MSK7                          630
#define SSP1STAT                      631
#define BF                            632
#define UA                            633
#define R_nW                          634
#define S                             635
#define P                             636
#define D_nA                          637
#define CKE                           638
#define SMP                           639
#define SSP1CON1                      640
#define SSPM0                         641
#define SSPM                          642
#define SSPM1                         643
#define SSPM2                         644
#define SSPM3                         645
#define CKP                           646
#define SSPEN                         647
#define SSPOV                         648
#define WCOL                          649
#define SSP1CON2                      650
#define SEN                           651
#define RSEN                          652
#define PEN                           653
#define RCEN                          654
#define ACKEN                         655
#define ACKDT                         656
#define ACKSTAT                       657
#define GCEN                          658
#define SSP1CON3                      659
#define DHEN                          660
#define AHEN                          661
#define SBCDE                         662
#define SDAHT                         663
#define BOEN                          664
#define SCIE                          665
#define PCIE                          666
#define ACKTIM                        667
#define ODCONA0                       668
#define ODCONA                        669
#define ODCONA1                       670
#define ODCONA2                       671
#define ODCONA3                       672
#define ODCONA4                       673
#define ODCONA5                       674
#define ODCONA6                       675
#define ODCONA7                       676
#define ODCONB0                       677
#define ODCONB                        678
#define ODCONB1                       679
#define ODCONB2                       680
#define ODCONB3                       681
#define ODCONB4                       682
#define ODCONB5                       683
#define ODCONB6                       684
#define ODCONB7                       685
#define ODCONC0                       686
#define ODCONC                        687
#define ODCONC1                       688
#define ODCONC2                       689
#define ODCONC3                       690
#define ODCONC4                       691
#define ODCONC5                       692
#define ODCONC6                       693
#define ODCONC7                       694
#define ODCOND0                       695
#define ODCOND                        696
#define ODCOND1                       697
#define ODCOND2                       698
#define ODCOND3                       699
#define ODCOND4                       700
#define ODCOND5                       701
#define ODCOND6                       702
#define ODCOND7                       703
#define ODCONE0                       704
#define ODCONE                        705
#define ODCONE1                       706
#define ODCONE2                       707
#define CCPR1L                        708
#define CCPR1H                        709
#define CCP1CON                       710
#define CCP1M0                        711
#define CCP1M                         712
#define CCP1M1                        713
#define CCP1M2                        714
#define CCP1M3                        715
#define DC1B                          716
#define DC1B0                         717
#define DC1B1                         718
#define CCPR2L                        719
#define CCPR2H                        720
#define CCP2CON                       721
#define CCP2M                         722
#define CCP2M0                        723
#define CCP2M1                        724
#define CCP2M2                        725
#define CCP2M3                        726
#define DC2B0                         727
#define DC2B                          728
#define DC2B1                         729
#define SLRCONA0                      730
#define SLRCONA                       731
#define SLRCONA1                      732
#define SLRCONA2                      733
#define SLRCONA3                      734
#define SLRCONA4                      735
#define SLRCONA5                      736
#define SLRCONA6                      737
#define SLRCONA7                      738
#define SLRCONB                       739
#define SLRCONB0                      740
#define SLRCONB1                      741
#define SLRCONB2                      742
#define SLRCONB3                      743
#define SLRCONB4                      744
#define SLRCONB5                      745
#define SLRCONB6                      746
#define SLRCONB7                      747
#define SLRCONC                       748
#define SLRCONC0                      749
#define SLRCONC1                      750
#define SLRCONC2                      751
#define SLRCONC3                      752
#define SLRCONC4                      753
#define SLRCONC5                      754
#define SLRCONC6                      755
#define SLRCONC7                      756
#define SLRCOND0                      757
#define SLRCOND                       758
#define SLRCOND1                      759
#define SLRCOND2                      760
#define SLRCOND3                      761
#define SLRCOND4                      762
#define SLRCOND5                      763
#define SLRCOND6                      764
#define SLRCOND7                      765
#define SLRCONE0                      766
#define SLRCONE                       767
#define SLRCONE1                      768
#define SLRCONE2                      769
#define CCPR3L                        770
#define CCPR3H                        771
#define CCP3CON                       772
#define CCP3M                         773
#define CCP3M0                        774
#define CCP3M1                        775
#define CCP3M2                        776
#define CCP3M3                        777
#define DC3B                          778
#define DC3B0                         779
#define DC3B1                         780
#define INLVLA                        781
#define INLVLA0                       782
#define INLVLA1                       783
#define INLVLA2                       784
#define INLVLA3                       785
#define INLVLA4                       786
#define INLVLA5                       787
#define INLVLA6                       788
#define INLVLA7                       789
#define INLVLB                        790
#define INLVLB0                       791
#define INLVLB1                       792
#define INLVLB2                       793
#define INLVLB3                       794
#define INLVLB4                       795
#define INLVLB5                       796
#define INLVLB6                       797
#define INLVLB7                       798
#define INLVLC                        799
#define INLVLC0                       800
#define INLVLC1                       801
#define INLVLC2                       802
#define INLVLC3                       803
#define INLVLC4                       804
#define INLVLC5                       805
#define INLVLC6                       806
#define INLVLC7                       807
#define INLVLD0                       808
#define INLVLD                        809
#define INLVLD1                       810
#define INLVLD2                       811
#define INLVLD3                       812
#define INLVLD4                       813
#define INLVLD5                       814
#define INLVLD6                       815
#define INLVLD7                       816
#define INLVLE                        817
#define INLVLE0                       818
#define INLVLE1                       819
#define INLVLE2                       820
#define INLVLE3                       821
#define IOCAP                         822
#define IOCAP0                        823
#define IOCAP1                        824
#define IOCAP2                        825
#define IOCAP3                        826
#define IOCAP4                        827
#define IOCAP5                        828
#define IOCAP6                        829
#define IOCAP7                        830
#define IOCAN                         831
#define IOCAN0                        832
#define IOCAN1                        833
#define IOCAN2                        834
#define IOCAN3                        835
#define IOCAN4                        836
#define IOCAN5                        837
#define IOCAN6                        838
#define IOCAN7                        839
#define IOCAF0                        840
#define IOCAF                         841
#define IOCAF1                        842
#define IOCAF2                        843
#define IOCAF3                        844
#define IOCAF4                        845
#define IOCAF5                        846
#define IOCAF6                        847
#define IOCAF7                        848
#define IOCBP                         849
#define IOCBP0                        850
#define IOCBP1                        851
#define IOCBP2                        852
#define IOCBP3                        853
#define IOCBP4                        854
#define IOCBP5                        855
#define IOCBP6                        856
#define IOCBP7                        857
#define IOCBN0                        858
#define IOCBN                         859
#define IOCBN1                        860
#define IOCBN2                        861
#define IOCBN3                        862
#define IOCBN4                        863
#define IOCBN5                        864
#define IOCBN6                        865
#define IOCBN7                        866
#define IOCBF0                        867
#define IOCBF                         868
#define IOCBF1                        869
#define IOCBF2                        870
#define IOCBF3                        871
#define IOCBF4                        872
#define IOCBF5                        873
#define IOCBF6                        874
#define IOCBF7                        875
#define IOCCP0                        876
#define IOCCP                         877
#define IOCCP1                        878
#define IOCCP2                        879
#define IOCCP3                        880
#define IOCCP4                        881
#define IOCCP5                        882
#define IOCCP6                        883
#define IOCCP7                        884
#define IOCCN0                        885
#define IOCCN                         886
#define IOCCN1                        887
#define IOCCN2                        888
#define IOCCN3                        889
#define IOCCN4                        890
#define IOCCN5                        891
#define IOCCN6                        892
#define IOCCN7                        893
#define IOCCF0                        894
#define IOCCF                         895
#define IOCCF1                        896
#define IOCCF2                        897
#define IOCCF3                        898
#define IOCCF4                        899
#define IOCCF5                        900
#define IOCCF6                        901
#define IOCCF7                        902
#define IOCEP                         903
#define IOCEP3                        904
#define IOCEN                         905
#define IOCEN3                        906
#define IOCEF                         907
#define IOCEF3                        908
#define OPA1CON                       909
#define OPA1CON_PCH                   910
#define OPA1PCH                       911
#define OPA1CON_PCH0                  912
#define OPA1PCH0                      913
#define OPA1CON_PCH1                  914
#define OPA1PCH1                      915
#define OPA1CON_SP                    916
#define OPA1SP                        917
#define OPA1CON_EN                    918
#define OPA1EN                        919
#define OPA2CON                       920
#define OPA2CON_PCH                   921
#define OPA2CON_PCH0                  922
#define OPA2PCH                       923
#define OPA2PCH0                      924
#define OPA2CON_PCH1                  925
#define OPA2PCH1                      926
#define OPA2CON_SP                    927
#define OPA2SP                        928
#define OPA2EN                        929
#define OPA2CON_EN                    930
#define OPA3CON                       931
#define OPA3CON_PCH0                  932
#define OPA3CON_PCH                   933
#define OPA3PCH                       934
#define OPA3PCH0                      935
#define OPA3CON_PCH1                  936
#define OPA3PCH1                      937
#define OPA3SP                        938
#define OPA3CON_SP                    939
#define OPA3CON_EN                    940
#define OPA3EN                        941
#define CLKRCON                       942
#define CLKRDIV                       943
#define CLKRDIV0                      944
#define CLKRDIV1                      945
#define CLKRDIV2                      946
#define CLKRDC                        947
#define CLKRDC0                       948
#define CLKRDC1                       949
#define CLKRSLR                       950
#define CLKROE                        951
#define CLKREN                        952
#define PSMC1CON                      953
#define P1MODE                        954
#define P1MODE0                       955
#define P1MODE1                       956
#define P1MODE2                       957
#define P1MODE3                       958
#define P1DBRE                        959
#define P1DBFE                        960
#define PSMC1LD                       961
#define PSMC1EN                       962
#define PSMC1MDL                      963
#define P1MSRC0                       964
#define P1MSRC                        965
#define P1MSRC1                       966
#define P1MSRC2                       967
#define P1MSRC3                       968
#define P1MDLBIT                      969
#define P1MDLPOL                      970
#define P1MDLEN                       971
#define PSMC1SYNC                     972
#define P1SYNC0                       973
#define P1SYNC1                       974
#define P1SYNC2                       975
#define P1DCPOL                       976
#define P1PRPOL                       977
#define P1POFST                       978
#define PSMC1CLK                      979
#define P1CSRC                        980
#define P1CSRC0                       981
#define P1CSRC1                       982
#define P1CPRE                        983
#define P1CPRE0                       984
#define P1CPRE1                       985
#define PSMC1OEN                      986
#define P1OEA                         987
#define P1OEB                         988
#define P1OEC                         989
#define P1OED                         990
#define P1OEE                         991
#define P1OEF                         992
#define PSMC1POL                      993
#define P1POLA                        994
#define P1POLB                        995
#define P1POLC                        996
#define P1POLD                        997
#define P1POLE                        998
#define P1POLF                        999
#define P1INPOL                       1000
#define PSMC1BLNK                     1001
#define P1REBM                        1002
#define P1REBM0                       1003
#define P1REBM1                       1004
#define P1FEBM0                       1005
#define P1FEBM                        1006
#define P1FEBM1                       1007
#define PSMC1REBS                     1008
#define P1REBSC1                      1009
#define P1REBSC2                      1010
#define P1REBSC3                      1011
#define P1REBSC4                      1012
#define P1REBSIN                      1013
#define PSMC1FEBS                     1014
#define P1FEBSC1                      1015
#define P1FEBSC2                      1016
#define P1FEBSC3                      1017
#define P1FEBSC4                      1018
#define P1FEBSIN                      1019
#define PSMC1PHS                      1020
#define P1PHST                        1021
#define P1PHSC1                       1022
#define P1PHSC2                       1023
#define P1PHSC3                       1024
#define P1PHSC4                       1025
#define P1PHSIN                       1026
#define PSMC1DCS                      1027
#define P1DCST                        1028
#define P1DCSC1                       1029
#define P1DCSC2                       1030
#define P1DCSC3                       1031
#define P1DCSC4                       1032
#define P1DCSIN                       1033
#define PSMC1PRS                      1034
#define P1PRST                        1035
#define P1PRSC1                       1036
#define P1PRSC2                       1037
#define P1PRSC3                       1038
#define P1PRSC4                       1039
#define P1PRSIN                       1040
#define PSMC1ASDC                     1041
#define P1ASDOV                       1042
#define P1ARSEN                       1043
#define P1ASDEN                       1044
#define P1ASE                         1045
#define PSMC1ASDL                     1046
#define P1ASDLA                       1047
#define P1ASDLB                       1048
#define P1ASDLC                       1049
#define P1ASDLD                       1050
#define P1ASDLE                       1051
#define P1ASDLF                       1052
#define PSMC1ASDS                     1053
#define P1ASDSC1                      1054
#define P1ASDSC2                      1055
#define P1ASDSC3                      1056
#define P1ASDSC4                      1057
#define P1ASDSIN                      1058
#define PSMC1INT                      1059
#define P1TPRIF                       1060
#define P1TDCIF                       1061
#define P1TPHIF                       1062
#define P1TOVIF                       1063
#define P1TPRIE                       1064
#define P1TDCIE                       1065
#define P1TPHIE                       1066
#define P1TOVIE                       1067
#define PSMC1PHL                      1068
#define PSMC1PH0                      1069
#define PSMC1PH1                      1070
#define PSMC1PH2                      1071
#define PSMC1PH3                      1072
#define PSMC1PH4                      1073
#define PSMC1PH5                      1074
#define PSMC1PH6                      1075
#define PSMC1PH7                      1076
#define PSMC1PHH                      1077
#define PSMC1PH8                      1078
#define PSMC1PH9                      1079
#define PSMC1PH10                     1080
#define PSMC1PH11                     1081
#define PSMC1PH12                     1082
#define PSMC1PH13                     1083
#define PSMC1PH14                     1084
#define PSMC1PH15                     1085
#define PSMC1DCL                      1086
#define PSMC1DC0                      1087
#define PSMC1DC1                      1088
#define PSMC1DC2                      1089
#define PSMC1DC3                      1090
